import { ApiProperty } from '@nestjs/swagger';

export class QAItemDto {
  @ApiProperty({ example: 'Що таке змінна в JavaScript?' })
  q: string;

  @ApiProperty({ example: 'Це контейнер для зберігання даних.' })
  a: string;
}

export class QAArrayDto {
  @ApiProperty({
    type: [QAItemDto],
    example: [
      {
        q: 'Що таке змінна в JavaScript?',
        a: 'Це контейнер для зберігання даних.',
      },
      {
        q: 'Що таке масив?',
        a: 'Структура даних, що зберігає список значень.',
      },
      { q: "Що таке об'єкт?", a: 'Набір пар ключ-значення.' },
      { q: 'Що робить оператор === ?', a: 'Порівнює значення і тип даних.' },
      {
        q: 'Що таке функція?',
        a: 'Блок коду, який можна викликати багато разів.',
      },
      {
        q: 'Що таке DOM?',
        a: "Об'єктна модель документа для роботи зі сторінкою.",
      },
      { q: 'Що таке JSON?', a: 'Формат обміну даними у вигляді тексту.' },
      {
        q: 'Що таке проміс?',
        a: "Об'єкт, який представляє результат асинхронної операції.",
      },
      {
        q: 'Що таке callback?',
        a: 'Функція, передана як аргумент у іншу функцію.',
      },
      {
        q: 'Що таке цикл for?',
        a: 'Конструкція для багатократного виконання блоку коду.',
      },
    ],
  })
  items: QAItemDto[];
}
